Tekla Open API Reference for Tekla Structures 2025
View.ViewAttributes Constructor
 Creates a new view attributes instance that loads standard attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ViewAttributes()
Public Sub New
See Also
Reference
View.ViewAttributes Class
View.ViewAttributes Overload
Tekla.Structures.Drawing Namespace